# GlazingColorByObject Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Glazing..::..GlazingColorByObject Property
Glazing Class See Also
---
The property labeled "Color By Object" from the "Glazing" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string GlazingColorByObject { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GlazingColorByObject As String
	Get
```

Visual C++
---
```text
public:
static property String^ GlazingColorByObject {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyBoolean".
# See Also
Glazing Class
Autodesk.Revit.DB.Visual Namespace